app/Controllers/controller_equipe.php

    public function perfil()
    {
        // Obtém o ID da equipe da sessão
        $equipeId = session()->get('Id_Equipe');

        // Crie uma instância do modelo da equipe
        $equipeModel = new model_equipe();

        // Busque os dados da equipe com base no ID
        $equipe = $equipeModel->find($equipeId);
---
SELECT *
FROM `tbl_equipe`
WHERE `tbl_equipe`.`Id_Equipe` = '1'
SELECT *
FROM `tbl_equipe`
WHERE `tbl_equipe`.`Id_Equipe` = '2'

    public function gerenciarEquipe()
    {
        $equipeModel = new model_equipe();
        $usuarioEquipeModel = new model_usuarioEquipe();

        // Verifica se o usuário está logado
        if (!session()->get('Id_Usuario')) {
            // Redireciona para a página de login
            return redirect()->to('login');
        }

        $usuarioId = session()->get('Id_Usuario');
        $equipeId = session()->get('Id_Equipe');

        // Verifica se o usuário é o capitão da equipe
        $Tipo = $usuarioEquipeModel->getTipoUsuario($usuarioId, $equipeId);
        if ($Tipo != 1) {
            // Redireciona para outra página, pois apenas o capitão tem acesso
            return redirect()->to('outra_pagina');
        }

        // Obtém a equipe e a lista de jogadores candidatos
        $equipe = $equipeModel->find($equipeId);
---
SELECT *
FROM `tbl_equipe`
WHERE `tbl_equipe`.`Id_Equipe` = '10'