app/Controllers/controller_partida.php

SELECT *
FROM `tbl_partida`
WHERE `tbl_partida`.`Id_Partida` = '3'
---
    public function entrarPartida($idPartida)
    {
        // Verifica se o usuário está logado
        if (!session()->get('Id_Usuario')) {
            // Redireciona para a página de login
            return redirect()->to('login');
        }

        // Obtém a partida pelo ID
        $partidaModel = new model_partida();
        $partida = $partidaModel->find($idPartida);