app/Models/model_agenda.php

SELECT `tbl_usuario`.`nome`, `tbl_usuario`.`email`
FROM `tbl_agenda`
JOIN `tbl_usuario` ON `tbl_usuario`.`id_usuario` = `tbl_agenda`.`id_equipe`
WHERE `tbl_agenda`.`id_partida` = '3'
AND `tbl_agenda`.`status` = 1
---
    public function getParticipantes($idPartida)
    {
        return $this->select('tbl_usuario.nome, tbl_usuario.email, tbl_usuario.login')
            ->join('tbl_usuario', 'tbl_usuario.id_usuario = tbl_agenda.id_equipe')
            ->where('tbl_agenda.id_partida', $idPartida)
            ->where('tbl_agenda.status', 1)
            ->findAll();

SELECT *
FROM `tbl_agenda`
JOIN `tbl_partida` ON `tbl_partida`.`id_partida` = `tbl_agenda`.`id_partida`
WHERE `tbl_agenda`.`id_equipe` = '1'
AND `tbl_agenda`.`status` = 1
---
    public function getPartidasAtivasEquipe($equipeId)
{
    return $this->db->table('tbl_agenda')
        ->join('tbl_partida', 'tbl_partida.id_partida = tbl_agenda.id_partida')
        ->where('tbl_agenda.id_equipe', $equipeId)
        ->where('tbl_agenda.status', 1)
        ->get()
        ->getResultArray();