app/Models/model_usuarioEquipe.php

SELECT `tbl_usuario`.*, `tbl_participacao`.`Tipo`
FROM `tbl_participacao`
JOIN `tbl_usuario` ON `tbl_usuario`.`Id_Usuario` = `tbl_participacao`.`Id_Usuario`
WHERE `tbl_participacao`.`Id_Equipe` = '2'
---
    public function getParticipantesPorEquipe($equipeId)
    {
        // Consulta para obter os participantes da equipe com base no ID da equipe
        $this->select('tbl_usuario.*')
            ->join('tbl_usuario', 'tbl_usuario.id_usuario = tbl_participacao.id_usuario')
            ->where('tbl_participacao.id_equipe', $equipeId);

        return $this->findAll();